var nickName = ["刘阿斗", "扶苏", "胡亥", "蒙恬", "王翦", "苏秦", "张仪", "孙膑", "庞涓", "鬼谷子", "吕不韦", "刘邦", "韩信",
	"萧何", "樊哙", "范增", "沈万三", "朱无视", "古三通", "孙悟空", "猪八戒", "沙悟净", "如来", "观世音", "玉皇大帝", "黑熊精", "老鼠精", "金蝉子", "李世明",
	"杨广", "嬴政", "文殊", "女王", "蝎子精", "昴日星官", "黎山老母", "白起", "吴起", "孙武子", "姜子牙", "哪吒", "帝辛", "李靖", "黄飞虎", "杨戬", "雷震子",
	"闻仲", "玉兔", "嫦娥", "千里眼", "顺风耳", "哮天犬", "武则天", "孝庄", "康熙", "朱元璋", "朱棣", "朱彪", "曹操", "刘备", "张飞", "赵云", "刘协",
	"司马懿", "诸葛亮", "周瑜", "小乔", "大乔", "乔国老", "吴国太", "孙权", "孙尚香", "夏侯惇", "夏侯霸", "马超", "关羽", "关平", "关兴", "张苞", "廖化",
	"魏延", "钟会", "邓艾", "姜维", "张辽", "徐晃", "黄盖", "韩当", "周泰", "颜良", "文丑", "袁绍", "田丰", "徐庶", "庞统", "杨仪", "霍去病",
	"李广", "刘彻", "巨灵神", "太上老君"

];

function getNickName() {
	 var num =  Math.ceil(Math.random()*10); 
	return nickName[num];
}

export default {
	getNickName,
}
